tutorials/compressible/PBNS/cpbnsLTS/RAE2822/0/nuTilda
/*---------------------------------------------------------------------------*\
Caelus 10.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3e-005;

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 3e-005;
        value           uniform 3e-005;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
