tutorials/compressible/PBNS/cpbnsLTS/RAE2822/0/p
/*---------------------------------------------------------------------------*\
Caelus 10.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 108988;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    farfield
    {
        type            fixedValue;
        value           uniform 108988;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
