tutorials/compressible/PBNS/cpbnsLTS/RAE2822/constant/RASProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//RASModel            realizableKE;
//RASModel            kOmegaSST;
RASModel            SpalartAllmaras;

turbulence          on;

printCoeffs         on;

// ************************************************************************* //
