tutorials/compressible/PBNS/cpbnsLTS/RAE2822/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         localEuler rDeltaT;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          none;
    div(phi,U)       Gauss linearBJ;
    div(phiHat,p)    Gauss linearBJ;
    div(phi,h)       Gauss linearBJ;
    div(phi,k)       Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega)   Gauss upwind;
    div(phi,nuTilda) Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(U,p)         Gauss linearBJ;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
    reconstruct(T)    linearBJ;
}

snGradSchemes
{
    default           corrected;
}


// ************************************************************************* //
